cask_args appdir: '/Applications'
tap 'homebrew/bundle'

tap 'caius/jo'
tap 'caskroom/cask'
tap 'dart-lang/dart'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/versions'
tap 'josegonzalez/php'
tap 'sanemat/font'
tap 'supermomonga/splhack'

cask 'java'

brew 'android-platform-tools'
brew 'icu4c'
brew 'boost'
brew 'cmake'
brew 'autoconf'
brew 'xz'
brew 'automake'
brew 'awscli'
brew 'bazaar'
brew 'pkg-config'
brew 'libatomic_ops'
brew 'bdw-gc'
brew 'pcre'
brew 'gettext'
brew 'git'
brew 'go'
brew 'docker'
brew 'docker-machine'
brew 'ghc'
brew 'cabal-install'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'libffi'
brew 'glib'
brew 'cairo'
brew 'ocaml'
brew 'camlp4'
brew 'clib'
brew 'gmp'
brew 'isl'
brew 'cloog'
brew 'cscope'
brew 'ctags'
brew 'readline'
brew 'discount'
brew 'doctl'
brew 'gobject-introspection'
brew 'harfbuzz'
brew 'pango'
brew 'jpeg'
brew 'libtiff'
brew 'jasper'
brew 'netpbm'
brew 'gts'
brew 'graphviz'
brew 'doxygen'
brew 'dynamodb-local'
brew 'libtool'
brew 'fontforge'
brew 'mpfr'
brew 'libmpc'
brew 'gcc'
brew 'gdbm'
brew 'ghq'
brew 'gnu-getopt'
brew 'git-now'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'httpie'
brew 'hub'
brew 'little-cms2'
brew 'imagemagick'
brew 'jbig2dec'
brew 'jo'
brew 'oniguruma'
brew 'jq'
brew 'snappy'
brew 'makedepend'
brew 'openssl'
brew 'libevent'
brew 'libgpg-error'
brew 'libgcrypt'
brew 'libksba'
brew 'libmemcached'
brew 'sqlite'
brew 'python'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'lua'
brew 'lv'
brew 'lz4'
brew 'mhash'
brew 'mcrypt'
brew 'md5sha1sum'
brew 'mercurial'
brew 'mycli'
brew 'ngrep'
brew 'nkf'
brew 'nmap'
brew 'node'
brew 'opam'
brew 'pandoc'
brew 'peco'
brew 'pidof'
brew 'pwgen'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'qt'
brew 'shiboken'
brew 'pyside'
brew 'ruby-build'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'rlwrap'
brew 's3cmd'
brew 'sbt'
brew 'source-highlight'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig', args: ['with-docs']
brew 'tmux'
brew 'todo-txt'
brew 'tree'
brew 'unixodbc'
brew 'weechat', args: ['with-ruby', 'with-perl']
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'dart-lang/dart/dart', args: ['with-dartium', 'with-content-shell']
brew 'homebrew/completions/django-completion'
brew 'homebrew/completions/pip-completion'
brew 'sanemat/font/ricty'
brew 'vim', args: ['--with-lua', '--with-luajit']

cask 'google-japanese-ime'
cask 'mjolnir'
cask 'flux'
cask 'iterm2'
cask 'karabiner'
cask 'macdown'
cask 'appcleaner'
cask 'vagrant'
cask 'virtualbox'
cask 'google-chrome'
cask 'firefox'
cask 'dropbox'
cask 'google-drive'
