cask_args appdir: '/Applications'
tap 'homebrew/bundle'

tap 'caius/jo'
tap 'caskroom/cask'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/versions'
tap 'sanemat/font'
tap 'supermomonga/splhack'

brew 'git'
brew 'git-now'
brew 'cmake'
brew 'ctags'
brew 'readline'
brew 'graphviz'
brew 'doxygen'
brew 'httpie'
brew 'jo'
brew 'jq'
brew 'openssl'
brew 'libevent'
brew 'lua'

brew 'mycli'
brew 'ngrep'
brew 'nkf'
brew 'nmap'
brew 'peco'
brew 'reattach-to-user-namespace'

brew 'rename'
brew 'rlwrap'
brew 'source-highlight'
brew 'the_silver_searcher'
brew 'tig', args: ['with-docs']

brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

brew 'vim', args: ['--with-lua', '--with-luajit']

cask 'google-japanese-ime'
cask 'mjolnir'
cask 'flux'
cask 'iterm2'
cask 'macdown'
cask 'appcleaner'
cask 'vagrant'
cask 'virtualbox'
cask 'google-chrome'
cask 'firefox'
cask 'dropbox'
cask 'google-drive'
cask 'font-myrica'
cask 'font-myricam'
