brew "vim"
brew "rename"
brew "tree"
brew "wget"
brew "bash"
brew "bash-completion"
brew "eza"
brew "fd"
brew "rg"
brew "zoxide"
brew "tig"
brew "tmux"
brew "reattach-to-user-namespace"
brew "urlview"
brew "bat"
brew "fpp"
brew "ghq"
brew "fzf"
brew "starship"
brew "rlwrap"
brew "coreutils"
brew "grep"
brew "gawk"
brew "gzip"
brew "gnu-tar"
brew "gnu-sed"
brew "gnu-time"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gh"  # github/gh/gh
brew "gpg2"
brew "pinentry-mac"
brew "colima"
brew "asdf"
